# Задана натуральная степень k. Сформировать случайным образом список коэффициентов (значения от 0 до 100) многочлена и записать в файл многочлен степени k.
# Пример:
# - k=2 => 2*x² + 4*x + 5 = 0 или x² + 5 = 0 или 10*x² = 0
# - k=4 => 8*(x**4) + 9*(x**3) + 1*(x**2) + 5*x + 4 = 0 или 8*(x**4) + 5*x + 4 = 0 и т.д.
import random


def write():
    a,b,c=random.randint(0,100),random.randint(0,100),random.randint(0,100)
    k=input()
    with open ("file.txt","w") as file:
        file.write(f"{a}*x**{k} + {b}*x + {c} =0")

write()